src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Компании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ЗаписываемыйДокумент, ПараметрыЗаписи)
	
	Сообщить("Всего в документе " + 
	ЗаписываемыйДокумент.ПереченьТоваров.Количество() + " строк, с количеством товаров " + 
	ЗаписываемыйДокумент.ПереченьТоваров.Итог("Количество") + " шт");

КонецПроцедуры
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент) //программируем реакцию системы на события, связанные с полем формы  
	
	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные; //получаем строку фокуса пользователя
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена; //пересчитываем сумму
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	
КонецПроцедуры
